{"weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"dtype": "float32", "shape": [192], "name": "batch_norm_layer/gamma"}, {"dtype": "float32", "shape": [192], "name": "batch_norm_layer/beta"}, {"dtype": "float32", "shape": [192], "name": "batch_norm_layer/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "batch_norm_layer/moving_variance"}, {"dtype": "float32", "shape": [300, 400], "name": "bi_lstm_layer0/forward_lstm_1/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "bi_lstm_layer0/forward_lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "bi_lstm_layer0/forward_lstm_1/bias"}, {"dtype": "float32", "shape": [300, 400], "name": "bi_lstm_layer0/backward_lstm_1/kernel"}, {"dtype": "float32", "shape": [100, 400], "name": "bi_lstm_layer0/backward_lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [400], "name": "bi_lstm_layer0/backward_lstm_1/bias"}, {"dtype": "float32", "shape": [1, 200, 64], "name": "conv1d_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1d_1/bias"}, {"dtype": "float32", "shape": [3, 200, 64], "name": "conv1d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1d_2/bias"}, {"dtype": "float32", "shape": [5, 200, 64], "name": "conv1d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv1d_3/bias"}, {"dtype": "float32", "shape": [17799, 300], "name": "embedding_layer0/embeddings"}, {"dtype": "float32", "shape": [200], "name": "rnn_batch_norm_layer0/gamma"}, {"dtype": "float32", "shape": [200], "name": "rnn_batch_norm_layer0/beta"}, {"dtype": "float32", "shape": [200], "name": "rnn_batch_norm_layer0/moving_mean"}, {"dtype": "float32", "shape": [200], "name": "rnn_batch_norm_layer0/moving_variance"}, {"dtype": "float32", "shape": [192, 3], "name": "softmax_layer/kernel"}, {"dtype": "float32", "shape": [3], "name": "softmax_layer/bias"}]}], "modelTopology": {"training_config": {"metrics": ["categorical_accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Nadam", "config": {"clipnorm": 1.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0020000000949949026, "schedule_decay": 0.004}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "int32", "batch_input_shape": [null, 60], "name": "input0", "sparse": false}, "name": "input0"}, {"class_name": "Embedding", "inbound_nodes": [[["input0", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_layer0", "dtype": "float32", "output_dim": 300, "trainable": false, "embeddings_regularizer": null, "input_dim": 17799, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 60], "activity_regularizer": null, "input_length": 60}, "name": "embedding_layer0"}, {"class_name": "Dropout", "inbound_nodes": [[["embedding_layer0", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.3, "trainable": true, "seed": null, "name": "rnn_spatial_droutout_layer"}, "name": "rnn_spatial_droutout_layer"}, {"class_name": "Bidirectional", "inbound_nodes": [[["rnn_spatial_droutout_layer", 0, 0, {}]]], "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.3, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, "trainable": true, "name": "bi_lstm_layer0"}, "name": "bi_lstm_layer0"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["bi_lstm_layer0", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "rnn_batch_norm_layer0"}, "name": "rnn_batch_norm_layer0"}, {"class_name": "Conv1D", "inbound_nodes": [[["rnn_batch_norm_layer0", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1]}, "name": "conv1d_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["rnn_batch_norm_layer0", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_2"}, {"class_name": "Conv1D", "inbound_nodes": [[["rnn_batch_norm_layer0", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_3"}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "global_pooling_layer0", "data_format": "channels_last"}, "name": "global_pooling_layer0"}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "global_pooling_layer1", "data_format": "channels_last"}, "name": "global_pooling_layer1"}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"trainable": true, "name": "global_pooling_layer2", "data_format": "channels_last"}, "name": "global_pooling_layer2"}, {"class_name": "Concatenate", "inbound_nodes": [[["global_pooling_layer0", 0, 0, {}], ["global_pooling_layer1", 0, 0, {}], ["global_pooling_layer2", 0, 0, {}]]], "config": {"trainable": true, "name": "concated_layer", "axis": -1}, "name": "concated_layer"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concated_layer", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "name": "batch_norm_layer"}, "name": "batch_norm_layer"}, {"class_name": "Dropout", "inbound_nodes": [[["batch_norm_layer", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "conv_dropout_layer"}, "name": "conv_dropout_layer"}, {"class_name": "Dense", "inbound_nodes": [[["conv_dropout_layer", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "softmax_layer", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "name": "softmax_layer"}], "output_layers": [["softmax_layer", 0, 0]], "name": "model_1", "input_layers": [["input0", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}